{"pageProps":{"postData":{"id":"mandatory-hello-world-post","contentHtml":"<p>\"Hello World!\"</p>\n<p><img src=\"/images/pranjal-dubey.webp\" alt=\"Pranjal Dubey\" title=\"Pranjal Dubey\"></p>\n<h5>That's me</h5>\n<p>So here it goes.</p>\n<p>I did a lot of beginner-level coding in C in my first year at college, it was nice and fun, but then I discovered web development around the start of my second year and immediately I was super-hooked. I remember creating a single <code>index.html</code> page with my name on it and then running to my mother to tell her that I made my first very own webpage! It was that big of a deal for me at the time. FYI, my mother had no clue what \"webpages\" were and I am pretty sure she still doesn't know. Although she knows what \"websites\" are 😄.</p>\n<p>It was nice changing (and breaking) a few things and seeing the result immediately. I loved how I could control the look of the page, giving bright flashy background colors to every <code>&#x3C;div></code> and setting the text to god-awful unreadable fonts (I thought they looked dope at that time).</p>\n<p>Soon afterwards I did a course on PHP (it was the \"cool thing\" way back then) and started working on multiple small projects (I eventually abandoned most of them). My first big real project was when I created a website for a student run NGO which worked on educating and providing basics needs to underprivileged kids. </p>\n<p>That project taught me a ton of things. Like it was a better experience if I used the same body font on every page and eventually I realized it was much easier to write the damned styles in a separate CSS file and not write everything inline! Thinking about that last part still makes me cringe. I created a contact form with all the validation checks I could think of, which when submitted, appended the data to a text file I created on the server (because obviously I didn't setup a database). Then I realised it didn't matter how many dope features I added if no one ever visited it. So I also did a lot of SEO work for the website and in turn for the NGO. I created social media accounts for the NGO and put up backlinks everywhere I possibly could. And after a ton of effort I made the NGO appear in Google Knowledge Graph. I was so damn happy when I first saw that.</p>\n<p>After college I moved to Bangalore (bye-bye Mathura) to work in a startup and there I started learning how things were done \"professionally\". I think I was extremely lucky to end up there. The CTO of the startup was a supergeek. He maintained a very high level of coding standard throughout the company and all of us engineers rightfully deified him. We saw tears in his eyes once when he saw one of our senior developers write really bad code. I remember we used to say in reference to the CTO, \"He's not a coder, he's an artist\". Ever since then I've never come across any programmer who cares so much about code.</p>\n<p><img src=\"/images/bangalore-office.webp\" alt=\"Bangalore tech park\" title=\"Bangalore tech park\"></p>\n<h5>My office campus in Bangalore.</h5>\n<p>Bangalore is a really nice city to live in (that is if you can tolerate the traffic). The weather is mostly pleasant and geographically it's located right in the middle of South India, so there are a lot of easily accessible places nearby if you like traveling.</p>\n<p>Now that I was finally a \"Software Engineer\" by profession, it was fun to live in the Coding Capital of India. When we went to hangout in the local cafes, it was quite common to hear phrases like, \"server response\", \"API timeout\" and \"production phat gaya\" from the nearby tables.</p>\n<p>Living amongst that many pro-techies nurtures the baby-techie within yourself. So I started thinking about creating my own personal website. My little home on the Internet. I started writing some code using Google's AMP tech because I wanted it to be crazy fast. I remember putting a lot of effort into it initially, but for some reasons which I don't clearly remember now it lost traction and I eventually shut down the domain.</p>\n<p>Then sometime back I deleted my Facebook account (because obviously) and also I permanently lost access to my Twitter account because I forgot where I saved the 2FA codes. May your ghost continue to live on <a href=\"https://twitter.com/pranjalworm\">@pranjalworm</a>.</p>\n<p>I irregularly post on my <a href=\"https://www.instagram.com/pranjalworm\">Instagram account</a>. I liked Instagram's original idea, a social network for artists, but I absolutely abhor the pile of shit it has eventually turned into. Thanks again Facebook.</p>\n<p>Once again I felt the need to create something which I could call my own. About a year back, I started working on my <a href=\"https://pranjaldubey.photography\">photography website</a>, but I can only put up my photography related stuff there and also it's meant to be primarily seen by my potential photoshoot clients. So it's built from the ground up to emphasize the \"professional\" photographer aspect of me.</p>\n<p>So I've started working on this website also on which you are (hopefully) reading this blog post. This website is supposed to more funky. I can post anything and everything here and I don't have to care about clients and my perceived \"image\" here. I am keeping it simple this time and using NextJS' blog template to build it as I want to focus solely on the blogging part for now. I have big plans for this website too. Let's see how it goes.</p>\n","date":"2021-03-18","draft":false,"title":"Mandatory Hello World Post","description":"Well it would be almost rude from the perspective of a programmer not to begin with a Hello World post."}},"__N_SSG":true}